Revit 2026 API

# ExternalResourceType Properties

---

The ExternalResourceType type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Guid | The Guid of GUID-based enum object. (Inherited from GuidEnum) |

#### Reference

ExternalResourceType Class

Autodesk.Revit.DB Namespace